<template>
    <div class="rules__container">
        <div class="rules__window">
            <div class="rules__wrapper">
                <h2 class="rules__title">Правила игры</h2>
                <div class="rules__text">
                    <p>
                        • Игровое поле состоят из 4 сегментов, каждый из которых производит свой уникальный тон и «загорается» при нажатии.<br>
                        • Раунд в игре состоит из хода компьютера. После чего игрок должен воспроизвести его порядок, нажимая кнопки.<br>
                        • Если игрок успешно воспроизводит последовательность, он переходит к следующему раунду.<br>
                        • Если игрок не воспроизводит последовательность, то игра окончена. В уведомлении отображается, в каком раунде игрок проиграл.<br>
                        • С каждым раундом количество кнопок (последовательность) увеличивается на один.<br>
                        <br>
                        <a class="link" href="https://en.wikipedia.org/wiki/Simon_(game)">Дополнительная информация об игре.</a><br>
                        <br>
                        В игре существует три уровня сложности:<br>
                        • Легкий.<br>
                        • Средний.<br>
                        • Сложный.<br>
                        <br>
                        Уровни отличаются между собой временным промежутком между последовательностью сигналов компьютера<br>
                    </p>
                </div>
                <div class="rules__buttons_wrapper">
                    <button class="button" @click="closeRules">Назад</button>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        methods: {
            closeRules() {
                this.$emit("closeRules");
            }
        }
    }
</script>